
/*
 * Network "set" (location) strings
 */
"DEFAULT_SET_NAME" = "Automatic";

/*
 * [System] Keychain descriptions for PPP
 */
"KEYCHAIN_KIND_PPP_PASSWORD" = "PPP Password";

/*
 * [System] Keychain descriptions for IPSec
 */
"KEYCHAIN_KIND_IPSEC_SHARED_SECRET" = "IPSec Shared Secret";
"KEYCHAIN_KIND_IPSEC_XAUTH_PASSWORD" = "IPSec XAuth Password";

/*
 * [System] Keychain descriptions for 802.1X
 *   Network Connection (Ethernet)
 *   Network Connection
 *   802.1X Password
 */
"KEYCHAIN_DESCRIPTION_EAPOL_INTERFACE" = "Network Connection (%@)";
"KEYCHAIN_DESCRIPTION_EAPOL" = "Network Connection";
"KEYCHAIN_KIND_EAPOL" = "802.1X Password";

/*
 * [System] Keychain descriptions for VPN
 */
"KEYCHAIN_KIND_VPN_PASSWORD" = "VPN Password";

/*
 * This header/message will appear when a "new" network interface has
 * been detected while the console is locked.  The new interface will
 * be added after LOCKED_SINGLE_INTERFACE_MESSAGE.
 */
"LOCKED_SINGLE_INTERFACE_HEADER"  = "A new network adapter was attached while the console was locked.";
"LOCKED_SINGLE_INTERFACE_MESSAGE" = "If you did not attach the following network adapter, choose Ignore.\r";
"LOCKED_SINGLE_INTERFACE_ADD"	  = "Use this adapter";

/*
 * This header/message appear when multiple "new" network interfaces have
 * been detected while the console is locked. A list of interfaces will be
 * added after LOCKED_MULTIPLE_INTERFACES_MESSAGE.
 */
"LOCKED_MULTIPLE_INTERFACES_HEADER"  = "New network adapters were attached while the console was locked.";
"LOCKED_MULTIPLE_INTERFACES_MESSAGE" = "If you did not attach the following network adapters, choose Ignore.\r";
"LOCKED_MULTIPLE_INTERFACES_ADD"     = "Use these adapters";

"LOCKED_INTERFACES_IGNORE" = "Ignore";
